Python 3.11.1 (v3.11.1:a7a450f84a, Dec  6 2022, 15:24:06) [Clang 13.0.0 (clang-1300.0.29.30)] on darwin
Type "help", "copyright", "credits" or "license()" for more information.
>>> wizard_list = 'Паучьи лапки, жабий палец, глаз тритона, крыло 􏰁 летучей мыши, жир слизня, перхоть змеи'
>>> print(wizard_list)
Паучьи лапки, жабий палец, глаз тритона, крыло 􏰁 летучей мыши, жир слизня, перхоть змеи
>>> wizard_list = ['Паучьи лапки', 'жабий палец', 'глаз тритона', 'крыло летучей мыши', 'жир слизня', 'перхоть змеи']
>>> print(wizard_list)
['Паучьи лапки', 'жабий палец', 'глаз тритона', 'крыло летучей мыши', 'жир слизня', 'перхоть змеи']
>>> print(wizard_list[2])
глаз тритона
>>> wizard_list[2] = 'язык улитки'
>>> print(wizard_list)
['Паучьи лапки', 'жабий палец', 'язык улитки', 'крыло летучей мыши', 'жир слизня', 'перхоть змеи']
>>> print(wizard_list[2:5])
['язык улитки', 'крыло летучей мыши', 'жир слизня']
>>> some_numbers = [1, 2, 5, 10, 20]
>>> some_strings = ['Нож', 'отточен', 'точен', 'очень']
>>> numbers_and_strings = [7, 'раз', 'отпей', 1, 'раз', 'отьешь']
>>> print(numbers_and_strings)
[7, 'раз', 'отпей', 1, 'раз', 'отьешь']
>>> numbers = [1, 2, 3, 4, 5]
>>> strings = ['хватит', 'циферки', 'считать']
>>> mylist = [numbers, strings]
>>> print(mylist)
[[1, 2, 3, 4, 5], ['хватит', 'циферки', 'считать']]
>>> wizard_list.append9'медвежий коготь')
SyntaxError: unmatched ')'
>>> wizard_list.append('медвежий коготь')
>>> print(wizard_list)
['Паучьи лапки', 'жабий палец', 'язык улитки', 'крыло летучей мыши', 'жир слизня', 'перхоть змеи', 'медвежий коготь']
wizard_list.apend('мандрагора')
wizard_list.apend('болиголов')
print(wizard_list)
wizard_list = ['Паучьи лапки', 'жабий палец', 'глаз тритона', 'крыло летучей мыши', 'жир слизня', 'перхоть змеи']
print(wizard_list)


